#+title: Contrast ratio values of the Doric themes
#+author: Protesilaos Stavrou (https://protesilaos.com)
#+startup: content indent

Evaluate this snippet. Then update a table by typing =C-c C-c= with
point at the =#+TBLFM:= line.

#+begin_src emacs-lisp :results output silent
;; Copied from my `modus-themes'.

;; This is the WCAG formula to measure relative luminance:
;; <https://www.w3.org/TR/WCAG20-TECHS/G18.html>.
(defun modus-themes--wcag-contribution (channel weight)
  "Return the CHANNEL contribution to overall luminance given WEIGHT."
  (* weight
     (if (<= channel 0.03928)
         (/ channel 12.92)
       (expt (/ (+ channel 0.055) 1.055) 2.4))))

(defun modus-themes-wcag-formula (hex)
  "Get WCAG value of color value HEX.
The value is defined in hexadecimal RGB notation, such #123456."
  (let ((channels (color-name-to-rgb hex))
        (weights '(0.2126 0.7152 0.0722))
        contribution)
    (while channels
      (push (modus-themes--wcag-contribution (pop channels) (pop weights)) contribution))
    (apply #'+ contribution)))

;;;###autoload
(defun modus-themes-contrast (c1 c2)
  "Measure WCAG contrast ratio between C1 and C2.
C1 and C2 are color values written in hexadecimal RGB."
  (let ((ct (/ (+ (modus-themes-wcag-formula c1) 0.05)
               (+ (modus-themes-wcag-formula c2) 0.05))))
    (max ct (/ ct))))

(defalias #'Λ #'modus-themes-contrast)

;; Just an alias for the built-in function that measures distance
;; between colours...
(defalias #'Δ #'color-distance)
#+end_src

* Light themes
:PROPERTIES:
:CUSTOM_ID: h:light-themes
:END:
** Doric Cherry
:PROPERTIES:
:CUSTOM_ID: h:doric-cherry
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #d7c9d0 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #35292f |   12.15 |            10.43 |       8.71 |              5.66 |      9.39 |
| fg-shadow-subtle  | #675462 |    6.07 |             5.21 |       4.35 |              2.83 |      4.69 |
| fg-neutral        | #5a4c5f |    6.96 |             5.98 |       4.99 |              3.25 |      5.38 |
| fg-shadow-intense | #683455 |    8.29 |             7.12 |       5.95 |              3.87 |      6.41 |
| fg-accent         | #77266e |    8.02 |             6.89 |       5.75 |              3.74 |      6.20 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.44 |             8.97 |       7.49 |              4.87 |      8.07 |
| fg-faint-green    | #056100 |    6.75 |             5.80 |       4.84 |              3.15 |      5.22 |
| fg-faint-yellow   | #5f4602 |    7.76 |             6.66 |       5.57 |              3.62 |      6.00 |
| fg-faint-blue     | #353362 |   10.18 |             8.74 |       7.30 |              4.75 |      7.87 |
| fg-faint-magenta  | #553372 |    8.72 |             7.49 |       6.26 |              4.07 |      6.74 |
| fg-faint-cyan     | #35485e |    8.19 |             7.03 |       5.87 |              3.82 |      6.33 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #d7c9d0 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f7edf1 |       0 |             2591 |       6292 |             43766 |      5533 |
| bg-shadow-subtle  | #e5dde0 |    2591 |                0 |        890 |             26336 |      1695 |
| bg-neutral        | #d7c9d0 |   10521 |             2728 |        556 |             12616 |      2351 |
| bg-shadow-intense | #cc95b7 |   43766 |            26336 |      17584 |                 0 |     19021 |
| bg-accent         | #edcae5 |    5533 |             1695 |       1022 |             19021 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Earth
:PROPERTIES:
:CUSTOM_ID: h:doric-earth
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d1ceb6 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #30232e |   12.72 |            11.09 |       9.40 |              6.20 |     10.40 |
| fg-shadow-subtle  | #635650 |    6.01 |             5.23 |       4.44 |              2.92 |      4.91 |
| fg-neutral        | #604d48 |    6.74 |             5.88 |       4.98 |              3.28 |      5.51 |
| fg-shadow-intense | #58383f |    8.71 |             7.59 |       6.44 |              4.24 |      7.12 |
| fg-accent         | #74321f |    8.06 |             7.02 |       5.96 |              3.93 |      6.59 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.18 |             8.87 |       7.52 |              4.96 |      8.32 |
| fg-faint-green    | #056100 |    6.58 |             5.74 |       4.87 |              3.21 |      5.38 |
| fg-faint-yellow   | #5f4602 |    7.57 |             6.59 |       5.59 |              3.68 |      6.18 |
| fg-faint-blue     | #353362 |    9.93 |             8.65 |       7.34 |              4.83 |      8.11 |
| fg-faint-magenta  | #553372 |    8.51 |             7.41 |       6.28 |              4.14 |      6.95 |
| fg-faint-cyan     | #35485e |    7.98 |             6.96 |       5.90 |              3.89 |      6.53 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d1ceb6 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f0eddf |       0 |             2246 |      10254 |             39749 |      5582 |
| bg-shadow-subtle  | #dfdfce |    2246 |                0 |       2977 |             23899 |      1527 |
| bg-neutral        | #d1ceb6 |   10254 |             2977 |          0 |             10796 |      1613 |
| bg-shadow-intense | #c09fa0 |   39749 |            23899 |      10796 |                 0 |     17459 |
| bg-accent         | #e7d5b9 |    5582 |             1527 |       1613 |             17459 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Light
:PROPERTIES:
:CUSTOM_ID: h:doric-light
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #dbdce1 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      15.34 |             10.60 |     17.80 |
| fg-shadow-subtle  | #455058 |    8.26 |             7.20 |       6.03 |              4.17 |      7.00 |
| fg-neutral        | #4f5559 |    7.56 |             6.59 |       5.52 |              3.82 |      6.41 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.11 |              6.30 |     10.57 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.10 |              4.91 |      8.24 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   11.96 |            10.42 |       8.73 |              6.03 |     10.13 |
| fg-faint-green    | #056100 |    7.73 |             6.74 |       5.65 |              3.90 |      6.55 |
| fg-faint-yellow   | #5f4602 |    8.89 |             7.74 |       6.49 |              4.48 |      7.53 |
| fg-faint-blue     | #353362 |   11.66 |            10.16 |       8.51 |              5.88 |      9.88 |
| fg-faint-magenta  | #553372 |    9.99 |             8.70 |       7.29 |              5.04 |      8.46 |
| fg-faint-cyan     | #35485e |    9.38 |             8.17 |       6.85 |              4.73 |      7.94 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #dbdce1 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ffffff |       0 |             2143 |       7009 |             48556 |      5572 |
| bg-shadow-subtle  | #efeff2 |    2143 |                0 |       1418 |             30569 |      1560 |
| bg-neutral        | #dbdce1 |   10642 |             3235 |        396 |             14408 |      2504 |
| bg-shadow-intense | #a0bcd0 |   48556 |            30569 |      19178 |                 0 |     22768 |
| bg-accent         | #d8f1f3 |    5572 |             1560 |       1336 |             22768 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Marble
:PROPERTIES:
:CUSTOM_ID: h:doric-marble
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #cdcdcd |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #202020 |   13.92 |            12.23 |      10.25 |              7.51 |     11.53 |
| fg-shadow-subtle  | #595959 |    5.98 |             5.26 |       4.41 |              3.23 |      4.96 |
| fg-neutral        | #505050 |    6.89 |             6.05 |       5.07 |              3.72 |      5.70 |
| fg-shadow-intense | #404040 |    8.86 |             7.78 |       6.52 |              4.78 |      7.34 |
| fg-accent         | #603d3a |    8.06 |             7.08 |       5.93 |              4.35 |      6.67 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.21 |             8.97 |       7.52 |              5.51 |      8.46 |
| fg-faint-green    | #056100 |    6.60 |             5.80 |       4.86 |              3.56 |      5.47 |
| fg-faint-yellow   | #5f4602 |    7.59 |             6.67 |       5.59 |              4.10 |      6.29 |
| fg-faint-blue     | #353362 |    9.96 |             8.75 |       7.33 |              5.38 |      8.25 |
| fg-faint-magenta  | #553372 |    8.53 |             7.49 |       6.28 |              4.60 |      7.07 |
| fg-faint-cyan     | #35485e |    8.01 |             7.04 |       5.90 |              4.32 |      6.63 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #cdcdcd |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ededed |       0 |             1777 |       9288 |             33751 |      5503 |
| bg-shadow-subtle  | #dfdfdf |    1777 |                0 |       2938 |             20036 |      1802 |
| bg-neutral        | #cdcdcd |    9288 |             2938 |          0 |              7628 |      2196 |
| bg-shadow-intense | #b0b0b0 |   33751 |            20036 |       7628 |                 0 |     15022 |
| bg-accent         | #e5d7c5 |    5503 |             1802 |       2196 |             15022 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Wind
:PROPERTIES:
:CUSTOM_ID: h:doric-wind
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d5e1d9 |    #c2ced0 |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000f0f |   16.81 |            14.51 |      12.12 |              9.98 |     13.82 |
| fg-shadow-subtle  | #565962 |    6.02 |             5.20 |       4.34 |              3.57 |      4.95 |
| fg-neutral        | #4f4f58 |    6.97 |             6.02 |       5.03 |              4.14 |      5.73 |
| fg-shadow-intense | #104038 |    9.97 |             8.61 |       7.19 |              5.92 |      8.20 |
| fg-accent         | #3f5900 |    6.84 |             5.91 |       4.94 |              4.06 |      5.63 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.29 |             8.88 |       7.42 |              6.11 |      8.46 |
| fg-faint-green    | #006500 |    6.32 |             5.45 |       4.55 |              3.75 |      5.19 |
| fg-faint-yellow   | #5f4602 |    7.65 |             6.60 |       5.51 |              4.54 |      6.29 |
| fg-faint-blue     | #353362 |   10.03 |             8.66 |       7.24 |              5.96 |      8.25 |
| fg-faint-magenta  | #553372 |    8.59 |             7.42 |       6.20 |              5.10 |      7.06 |
| fg-faint-cyan     | #35485e |    8.07 |             6.96 |       5.82 |              4.79 |      6.63 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d5e1d9 |    #c2ced0 |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #e8f0e9 |       0 |             2501 |      10149 |             32059 |      8580 |
| bg-shadow-subtle  | #d5e1d9 |    2501 |                0 |       2653 |             16965 |      2531 |
| bg-neutral        | #c2ced0 |   10149 |             2653 |          0 |              6954 |      2528 |
| bg-shadow-intense | #94c2bf |   32059 |            16965 |       6954 |                 0 |     11285 |
| bg-accent         | #c7e2c1 |    7387 |             1831 |       2187 |             11163 |       136 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

* Dark themes
:PROPERTIES:
:CUSTOM_ID: h:dark-themes
:END:
** Doric Dark
:PROPERTIES:
:CUSTOM_ID: h:doric-dark
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #43404c |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #ffffff |   21.00 |            13.35 |      10.11 |              8.49 |     12.97 |
| fg-shadow-subtle  | #a2a0b2 |    8.21 |             5.22 |       3.95 |              3.32 |      5.07 |
| fg-neutral        | #aeabbc |    9.35 |             5.94 |       4.50 |              3.78 |      5.78 |
| fg-shadow-intense | #cfcff8 |   13.93 |             8.86 |       6.71 |              5.63 |      8.61 |
| fg-accent         | #cda4df |    9.97 |             6.34 |       4.80 |              4.03 |      6.16 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    9.70 |             6.17 |       4.67 |              3.92 |      5.99 |
| fg-faint-green    | #85c397 |   10.25 |             6.52 |       4.94 |              4.14 |      6.33 |
| fg-faint-yellow   | #c4a992 |    9.44 |             6.00 |       4.55 |              3.81 |      5.83 |
| fg-faint-blue     | #95afd2 |    9.34 |             5.94 |       4.50 |              3.77 |      5.77 |
| fg-faint-magenta  | #c5a3b2 |    9.26 |             5.88 |       4.46 |              3.74 |      5.72 |
| fg-faint-cyan     | #a5bfce |   10.94 |             6.96 |       5.27 |              4.42 |      6.76 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #43404c |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #000000 |       0 |            22833 |      42853 |             78768 |     29991 |
| bg-shadow-subtle  | #332d38 |   22833 |                0 |       3147 |             17981 |      3273 |
| bg-neutral        | #43404c |   42853 |             3147 |          0 |              7562 |      5572 |
| bg-shadow-intense | #50447f |   78768 |            17981 |       7562 |                 0 |     16560 |
| bg-accent         | #521e40 |   29991 |             3273 |       5572 |             16560 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Fire
:PROPERTIES:
:CUSTOM_ID: h:doric-fire
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #4f4542 |           #601a2f |   #52402f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #f0e5e0 |   11.97 |             9.81 |       7.51 |             10.08 |      7.96 |
| fg-shadow-subtle  | #afa497 |    6.04 |             4.95 |       3.79 |              5.09 |      4.02 |
| fg-neutral        | #bfb4a7 |    7.26 |             5.95 |       4.55 |              6.11 |      4.83 |
| fg-shadow-intense | #e2b0a4 |    7.73 |             6.34 |       4.85 |              6.51 |      5.15 |
| fg-accent         | #e6a577 |    7.05 |             5.78 |       4.43 |              5.94 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #d09090 |    5.69 |             4.66 |       3.57 |              4.79 |      3.78 |
| fg-faint-green    | #85c397 |    7.22 |             5.92 |       4.53 |              6.08 |      4.81 |
| fg-faint-yellow   | #c4a992 |    6.65 |             5.45 |       4.17 |              5.60 |      4.42 |
| fg-faint-blue     | #95afd2 |    6.58 |             5.39 |       4.13 |              5.54 |      4.38 |
| fg-faint-magenta  | #c5a3b2 |    6.52 |             5.34 |       4.09 |              5.49 |      4.34 |
| fg-faint-cyan     | #a5bfce |    7.71 |             6.32 |       4.84 |              6.49 |      5.13 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #4f4542 |           #601a2f |   #52402f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a281d |       0 |             2476 |      10288 |              8354 |      6839 |
| bg-shadow-subtle  | #40332f |    2476 |                0 |       2812 |              4907 |      1427 |
| bg-neutral        | #4f4542 |   10288 |             2812 |          0 |              9102 |      1098 |
| bg-shadow-intense | #601a2f |    8354 |             4907 |       9102 |                 0 |      6285 |
| bg-accent         | #52402f |    6839 |             1427 |       1098 |              6285 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Obsidian
:PROPERTIES:
:CUSTOM_ID: h:doric-obsidian
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7e7e7 |   14.36 |            10.83 |       9.20 |              6.52 |     10.12 |
| fg-shadow-subtle  | #969696 |    6.00 |             4.53 |       3.85 |              2.73 |      4.23 |
| fg-neutral        | #a6a6a6 |    7.29 |             5.50 |       4.67 |              3.31 |      5.14 |
| fg-shadow-intense | #b0b0b0 |    8.19 |             6.17 |       5.24 |              3.72 |      5.77 |
| fg-accent         | #b59487 |    6.38 |             4.81 |       4.09 |              2.90 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    8.20 |             6.19 |       5.25 |              3.73 |      5.78 |
| fg-faint-green    | #85c397 |    8.67 |             6.53 |       5.55 |              3.94 |      6.11 |
| fg-faint-yellow   | #c4a992 |    7.98 |             6.02 |       5.11 |              3.62 |      5.62 |
| fg-faint-blue     | #95afd2 |    7.90 |             5.95 |       5.06 |              3.59 |      5.56 |
| fg-faint-magenta  | #c5a3b2 |    7.83 |             5.90 |       5.01 |              3.55 |      5.51 |
| fg-faint-cyan     | #a5bfce |    9.25 |             6.98 |       5.93 |              4.20 |      6.52 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #181818 |       0 |             4798 |      10485 |             28444 |      7113 |
| bg-shadow-subtle  | #2f2f2f |    4798 |                0 |       1097 |              9877 |       966 |
| bg-neutral        | #3a3a3a |   10485 |             1097 |          0 |              4390 |      1381 |
| bg-shadow-intense | #505050 |   28444 |             9877 |       4390 |                 0 |      8726 |
| bg-accent         | #432f2a |    7113 |              966 |       1381 |              8726 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Plum
:PROPERTIES:
:CUSTOM_ID: h:doric-plum
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e2d7e7 |   12.14 |             9.46 |       7.62 |              6.13 |      9.46 |
| fg-shadow-subtle  | #a694b1 |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
| fg-neutral        | #b3b1be |    7.99 |             6.23 |       5.02 |              4.03 |      6.23 |
| fg-shadow-intense | #cea6d0 |    8.03 |             6.25 |       5.04 |              4.05 |      6.26 |
| fg-accent         | #c586ba |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    7.79 |             6.07 |       4.89 |              3.93 |      6.08 |
| fg-faint-green    | #85c397 |    8.23 |             6.42 |       5.17 |              4.16 |      6.42 |
| fg-faint-yellow   | #c4a992 |    7.58 |             5.91 |       4.76 |              3.83 |      5.91 |
| fg-faint-blue     | #95afd2 |    7.50 |             5.85 |       4.71 |              3.79 |      5.85 |
| fg-faint-magenta  | #c5a3b2 |    7.44 |             5.79 |       4.67 |              3.75 |      5.80 |
| fg-faint-cyan     | #a5bfce |    8.79 |             6.85 |       5.52 |              4.44 |      6.86 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #221832 |       0 |             2845 |      10282 |             25593 |      5289 |
| bg-shadow-subtle  | #302f3c |    2845 |                0 |       2786 |             13581 |      3499 |
| bg-neutral        | #423b53 |   10282 |             2786 |          0 |              4250 |      5048 |
| bg-shadow-intense | #5e4170 |   25593 |            13581 |       4250 |                 0 |     12099 |
| bg-accent         | #501e3e |    5289 |             3499 |       5048 |             12099 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Water
:PROPERTIES:
:CUSTOM_ID: h:doric-water
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #3a3c4c |    #4a4a5f |           #496278 |   #403f75 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #edf0f8 |   12.54 |             9.54 |       7.56 |              5.58 |      8.43 |
| fg-shadow-subtle  | #aea6b8 |    6.09 |             4.63 |       3.67 |              2.71 |      4.09 |
| fg-neutral        | #c3c4c8 |    8.20 |             6.24 |       4.95 |              3.65 |      5.51 |
| fg-shadow-intense | #c0ddf2 |   10.12 |             7.70 |       6.10 |              4.50 |      6.80 |
| fg-accent         | #adade0 |    6.69 |             5.09 |       4.04 |              2.98 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    6.60 |             5.03 |       3.98 |              2.94 |      4.44 |
| fg-faint-green    | #85c397 |    6.98 |             5.31 |       4.21 |              3.10 |      4.69 |
| fg-faint-yellow   | #c4a992 |    6.42 |             4.89 |       3.87 |              2.86 |      4.32 |
| fg-faint-blue     | #95afd2 |    6.36 |             4.84 |       3.83 |              2.83 |      4.27 |
| fg-faint-magenta  | #c5a3b2 |    6.30 |             4.79 |       3.80 |              2.80 |      4.23 |
| fg-faint-cyan     | #a5bfce |    7.45 |             5.67 |       4.49 |              3.31 |      5.01 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #3a3c4c |    #4a4a5f |           #496278 |   #403f75 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a283d |       0 |             2814 |      10189 |             25450 |     12034 |
| bg-shadow-subtle  | #3a3c4c |    2814 |                0 |       2370 |             11685 |      4794 |
| bg-neutral        | #4a4a5f |   10189 |             2370 |          0 |              4032 |      2047 |
| bg-shadow-intense | #496278 |   25450 |            11685 |       4032 |                 0 |      5148 |
| bg-accent         | #403f75 |   12034 |             4794 |       2047 |              5148 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)
